app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "insurance"], ["description", "very important"], ["created_at", "2024-07-03 11:35:58.485737"], ["updated_at", "2024-07-03 11:35:58.485737"]]
---
  def create
    survey = Survey.create(survey_params)

SELECT "surveys".* FROM "surveys"
---
  def index
    survey = Survey.all
    if survey.present?

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    survey = Survey.find_by(id: params[:id])

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "surveys" WHERE "surveys"."id" = ?  [["id", 1]]
---
  def destroy
    survey = Survey.find_by(id: params[:id])
    if survey.delete

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "surveys" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "surveys"."id" = ?  [["name", "xcgvhjlj;khjghcgvhbkjl;"], ["description", "most important and must"], ["updated_at", "2024-07-03 12:00:02.634184"], ["id", 3]]
---
  def update
    survey = Survey.find_by(id: params[:id])
    if survey.present?
      survey.update(survey_params)